In [8]:
import pandas as pd

data1 ={"Emp Id":["E01","E02","E03","E04","E05","E06"],
        "Name":["Ram","Shyam","Rahul","Vishal","Ravi","Joh"],
        "Age":[34,56,23,44,32,36]}
data2 ={"Emp Id":["E01","E02","E03","E04","E05","E06"],
        "Salary":[45000,50000,34000,30000,50000,62000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)

  Emp Id    Name  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06     Joh   36
  Emp Id  Salary
0    E01   45000
1    E02   50000
2    E03   34000
3    E04   30000
4    E05   50000
5    E06   62000

In [11]:
print(pd.merge(df1,df2,on = "Emp Id"))

  Emp Id    Name  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   50000
2    E03   Rahul   23   34000
3    E04  Vishal   44   30000
4    E05    Ravi   32   50000
5    E06     Joh   36   62000

In [13]:
print(pd.merge(left = df1,right = df2,on = "Emp Id", how = "left"))

  Emp Id    Name  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   50000
2    E03   Rahul   23   34000
3    E04  Vishal   44   30000
4    E05    Ravi   32   50000
5    E06     Joh   36   62000

In [14]:
print(pd.merge(left = df1,right = df2,on = "Emp Id",how = "right"))

  Emp Id    Name  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   50000
2    E03   Rahul   23   34000
3    E04  Vishal   44   30000
4    E05    Ravi   32   50000
5    E06     Joh   36   62000

In [ ]:
import pandas as pd

data1 ={"Emp Id":["E01","E02","E03","E04","E05","E06"],
        "Name":["Ram","Shyam","Rahul","Vishal","Ravi","John"],
        "Age":[34,56,23,44,32,36]}

data2 ={"Emp Id":["E07","E08","E09","E010","E011","E012"],
        "Names":["bittu","chintu","pappu","chotu","bunty","golu"],
       "Age":[34,56,23,44,32,36]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [15]:
print(pd.concat([df1,df2]))

  Emp Id    Name   Age   Salary
0    E01     Ram  34.0      NaN
1    E02   Shyam  56.0      NaN
2    E03   Rahul  23.0      NaN
3    E04  Vishal  44.0      NaN
4    E05    Ravi  32.0      NaN
5    E06     Joh  36.0      NaN
0    E01     NaN   NaN  45000.0
1    E02     NaN   NaN  50000.0
2    E03     NaN   NaN  34000.0
3    E04     NaN   NaN  30000.0
4    E05     NaN   NaN  50000.0
5    E06     NaN   NaN  62000.0